// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

// function s(a,b) {
//     let res = a * b;
//     return res;
// }
//
// let result = s(5, 10)
// console.log(result)
//

// ==================================================================================================


// - створити функцію яка обчислює та повертає площу кола з радіусом r

// function s(p,r) {
//     let res = p * (r*r);
//     return res;
// }
// let result = s(3.14, 5)
// console.log(result)


// ==================================================================================================


// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

// function s(h,r) {
//     let res = 2* Math.PI * r * h ;
//     return res;
// }
// let result = s(15,5)
// console.log(result)


// ==================================================================================================


// - створити функцію яка приймає масив та виводить кожен його елемент


// function array(arr) {
//     for (const arrElement of arr) {
//         console.log(hello);
//     }
// }


// ==================================================================================================


// - створити функцію яка створює параграф з текстом. Текст задати через аргумент


// function paragraph(p) {
//     document.write(`<p>${p}</p>`)
//     console.log(p)
//
// }
// paragraph('GoodNight')
//
//


// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// function create(a) {
// document.write(`<ul>`)
// document.write(`<li>${a}</li>`)
// document.write(`<li>${a}</li>`)
// document.write(`<li>${a}</li>`)
// document.write(`</ul>`)
// }
// create(`item`)

// ==============================================================================================================

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

// function create (size){
//     document.write(`<ul>`)
//     for (let i = 0; i < size ; i++) {
//         document.write(`<li>item</li>`)
//     }
//     document.write(`</ul>`)
// }
// create(3)

// ==============================================================================================================

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список


// function list(arr){
//     document.write('<ul>');
//     for (const text of arr) {
//         document.write(`<li> ${text} </li>`);
//     }
//     document.write('</ul>');
//
// }
//
// list([true, false,1,`string`])


// ==============================================================================================================

// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.

// function obj(object) {
//     for (const objectElement of object) {
//         document.write(`<div>${objectElement.id}</div>`)
//         document.write(`<div>${objectElement.name}</div>`)
//         document.write(`<div>${objectElement.age}</div>`)
//     }
// }


